Revit 2027 API
BendingDetailTypeMultipleValuesIndicatorOptions Enumeration
 Describes how the parameters with multiple values will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailTypeMultipleValuesIndicatorOptions
Public Enumeration BendingDetailTypeMultipleValuesIndicatorOptions
public enum class BendingDetailTypeMultipleValuesIndicatorOptions
type BendingDetailTypeMultipleValuesIndicatorOptions
Members
Member name | Value | Description
FromOneBar | 0 |  Obtain parameter value from only one bar.
MinimumMaximum | 1 |  The values will be obtained from all included bars in the rebar set and it will be shown in a form like minimumValue...maximumValue.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace